Repository: MNTShop/minter-yyy-cashback
Catalog: languages/minter-yyy-cashback-*.po
Languages: es_es, ru_ru

source: Plugin that give you power of rewards your client! example for registration. Use FunFasy.dev to send minter transaction and YYY.cash to generate containers with money.
es_es: Plugin que le dan el poder de recompensas a su cliente! ejemplo de registro. Utilice FunFasy.dev para enviar la transacción minter y YYY.cash para generar contenedores con dinero.
ru_ru: Плагин, который даст вам силу награждать ваших клиентов реальными деньгами! Например за регистрацию. Используем FunFasy.dev для отправки Minter транзакций и YYY.cash для генерации пушей с bip.

source: Minter Push YYY.cash settings
es_es: Minter Push YYY.cash ajustes
ru_ru: Minter Push YYY.cash Настройки

source: Settings
es_es: Ajustes
ru_ru: Настройки

source: Minter YYY info
es_es: Información de Minter YYY
ru_ru: Minter YYY Информация

source: Push cost
es_es: Costo de Empuje
ru_ru: Стоимость пуша

source: User ID
es_es: ID de usario

source: Recipient email
es_es: Receptor de E-mail
ru_ru: Email получателя

source: Sender
es_es: Remitente
ru_ru: Отправитель

source: Password Push
es_es: Contraseña Push
ru_ru: Пароль пуша

source: Customization id
es_es: Personalización de ID

source: Push link ID
es_es: Enlace de empuje ID

source: Minter push address
es_es: Minter empuje de dirección
ru_ru: Минтер адрес пуша

source: Deep link push
es_es: Enlace profundo de empuje

source: Hash add balance
es_es: Hash agregando el saldo
ru_ru: Hash пополнения баланса

source: Email send?
es_es: ¿Enviar correo electrónico?
ru_ru: Email отправлен?

source: Push ticker
es_es: Push moneda
ru_ru: Push тикер

source: Push pay off coupon
es_es: Push
ru_ru: Купон обналичен?

source: Welcome
es_es: Bienvenidos
ru_ru: Добро пожаловать

source: Minter Wallet
es_es: Billetera

source: Rewards
es_es: Recompensas
ru_ru: Награды

source: Register on site
es_es: Registrarse en el sitio
ru_ru: Регистрация на сайте

source: Active reward?
es_es: Activar la recompensa?
ru_ru: Активировать награду?

source: Enabled
es_es: Habilitado
ru_ru: Включено

source: Use password in push?
es_es: Usar contraseña en push?
ru_ru: Генерировать пароли для пушей?

source: Impossible if active WooCommerce generate coupons
es_es: Imposible si WooCommerce activo genera cupones
ru_ru: Невозможно если активировано WooCommerce генерировать купоны

source: How many coins do you want to reward?
es_es: ¿Cuántas monedas quiere recompensar?
ru_ru: Сколько монет потратить на награду?

source: In Minter Wallet section you can add custom ticker
es_es: En la sección Billetera Minter puede agregar moneda personalizada
ru_ru: В секции Minter Wallet вы можете добавить свой тикер

source: Customization push settings
es_es: Ajustes de personalización
ru_ru: Настройка кастомизации пушей

source: Animation type
es_es: Tipo de animación
ru_ru: Тип анимации

source: Without animation
es_es: Sin animación
ru_ru: Без анимации

source: Papper plane
es_es: Avión de papel
ru_ru: Бумажный самолёт

source: Gift sending
es_es: Envío de regalos
ru_ru: Получение подарка

source: Milos time
es_es: Tiempo de Milos
ru_ru: Без комментариев

source: Head text push
es_es: Titular push
ru_ru: Подпись шапки пуша

source: Animation text
es_es: Texto de animación
ru_ru: Текст анимации

source: Background
es_es: Antecedentes
ru_ru: Фоновый цвет

source: Standard
es_es: Estándar
ru_ru: Стандартный

source: Black
es_es: Negro
ru_ru: Черный

source: Purple
es_es: Púrpura
ru_ru: Пурпурный

source: Pink
es_es: Rosa
ru_ru: Розовый

source: Blue
es_es: Azul
ru_ru: Синий

source: Green
es_es: Verde
ru_ru: Зеленый

source: E-mail notification
es_es: Notificación de correo electrónico
ru_ru: E-mail уведомления

source: E-mail from
es_es: Сorreo electrónico de
ru_ru: E-mail От

source: E-mail subject
es_es: Sujeta de correo electrónico
ru_ru: E-mail тема

source: HTML E-mail template
es_es: HTML patrón de correo electrónico

source: You can use template vars:<br> #COUPON_MESSAGE# - If you check generate coupon, in woocommerce settings, you can tell it to your customers in custom message<br> #PASSWORD_MESSAGE# - If you check generate push password , you can tell also it to your customers in custom message<br> #PUSH_URL# - Generated push url<br> #PUSH_LINK_ID# - Generated Link ID push also coupon code for woocommerce<br> #PUSH_PASSWORD# - Generated push password<br> #SITE_NAME# - returned from get_bloginfo() (Your default site name)
es_es: You can use template vars:<br> #COUPON_MESSAGE# - Si marca generar cupón, en la configuración de woocommerce, puede decírselo a sus clientes en un mensaje personalizado<br> #PASSWORD_MESSAGE# - Si marca generar contraseña push, también puede decírselo a sus clientes en un mensaje personalizado<br> #PUSH_URL# - Push url generada<br> #PUSH_LINK_ID# - El ID de enlace generado también genera un código de cupón para woocommerce<br> #PUSH_PASSWORD# - Contraseña push generada<br> #SITE_NAME# - devuelto por get_bloginfo() (Su nombre de sitio predeterminado)
ru_ru: Вы можете использовать переменные в своем шаблоне E-mail:<br> #COUPON_MESSAGE# - Если включили генерацию купонов, в секции WooCommerce, вы можете задать переменную шаблона чтобы сказать пользователем об этом<br> #PASSWORD_MESSAGE# - Если включили генерацию паролей в настройке награды, вы можете задать переменную шаблона чтобы сказать пользователем об этом<br> #PUSH_URL# - Сгенерированный адрес для открытия награды push url<br> #PUSH_LINK_ID# - Сгенерированный Link ID награды, также является купоном для woocommerce<br> #PUSH_PASSWORD# - Сгенерированный пароль для открытия награды<br> #SITE_NAME# -информация из get_bloginfo() (Имя вашего сайта)

source: Wallet ticker
es_es: Moneda de billetera
ru_ru: Тикер кошелька

source: Which coin use for pushes? example BIP
es_es: ¿Qué moneda usa para empujar? ejemplo BIP
ru_ru: Какой тикер использовать для отправки пушей? Например BIP

source: Addres which send Push for clients
es_es: Dirección que envía Push para clientes
ru_ru: Адрес, который отправляет пуши

source: Minter wallet mnemonic
es_es: Billetera de Minter mnemotécnica
ru_ru: Minter мнемоническая фраза

source: Minter wallet public key
es_es: Minter billetera clave pública
ru_ru: Minter публичный ключ кошелька

source: Minter wallet private key
es_es: Minter billetera clave privada
ru_ru: Minter приватный ключ кошелька

source: Minter Wallet seed
es_es: Billetera Minter seed
ru_ru: Minter seed кошелька

source: Use Coupons?
es_es: Usar Cupones?
ru_ru: Генерировать купоны?

source: Bip cost
es_es: Costo de BIP
ru_ru: Стоимость BIP

source: PROJECT ID
es_es: PROJECTO ID

source: PROJECT SECRET
es_es: SECRETO DEL PROYECTO

source: more info how to get it on <a target="_blank" href="https://funfasy.dev/">https://funfasy.dev/</a>
es_es: más información sobre cómo obtenerlo <a target=«_blank» href=«https://funfasy.dev/«>https://funfasy.dev/</a>
ru_ru: пройди регистрацию на <a target=«_blank» href=«https://funfasy.dev/«>https://funfasy.dev/</a> и получи свои API ключи

source: <h1> Welcome To Minter YYY Cashback plugin! </h1> <h2>Description</h2> <p>Plugin created for <code> #MinterPush 0.2 – Rewards Hackathon–Subscriptions</code></p> <p>EVERY question about this plugin asked here <a href="https://t.me/mntshop_official_group" rel="nofollow">[Official Telegram group]</a> would be answered.</p> <p>Wordpress Plugin gives you the power of rewards your client! example for registration. Use FunFasy.dev to send minter transaction and YYY.cash to generate containers with money.</p> <p>Throw next to walkthrough setup</p> <h3>In plugin settings</h3> <h4>FUNFASY Settings section</h4> <p>Register at <a href="https://funfasy.dev/" rel="nofollow">https://funfasy.dev/</a> and get your API keys and input your: <code>PROJECT ID</code> <code>PROJECT SECRET</code></p> <h4>Minter Wallet Settings section</h4> <blockquote> <p>When you install a plugin that generates a new empty wallet to send rewards.</p> </blockquote> <p>Input your ticker here. All generated rewards will be sent in that ticker.</p> <p>The balance would be displayed in the ticker</p> <blockquote> <p>Also in this section contain all information about wallet. Such as wallet mnemonic phrase, just copy and paste in your wallet app for example here <a href="https://wallet.bip.to" title="BIP Wallet" rel="nofollow">BIP Wallet</a>. And you can administrate wallet your new wallet.</p> </blockquote> <h4 >Rewards Settings section</h4> <blockquote> <p>In this section we have all predefined events like <code>Register on site </code>. You can customize it, but first, activate and some setup.</p> </blockquote> <p>Available options:</p> <ul> <li>Active (Activate reward)</li> <li>Generate password (If you want to generate random password for reward)</li> <li>How many coins do you want to reward? (how many coins will be sent for this reward)</li> <li>Customization push settings (Customize reward)</li> <li>Email notification settings (Customize Email notification such as from, template and some conditional message)</li> </ul> <blockquote> <p>Feel free to use default settings like a template</p> </blockquote> <h4>Woocommerce Settings section</h4> <blockquote> <p>In this section store params for woocommerce.</p> </blockquote> <p>Available options:</p> <ul> <li>BIP price ( First of all tell the plugin how many cost BIP in your local currency )</li> <li>Coupon generate ( You can activate coupon generator. After activated all rewards will generate woocommerce coupons basically on BIP cost )</li> </ul> <h2>Frequently Asked Questions</h2> <h3>Which services do you use?</h3> <p>We use:</p> <ul> <li>FunFasy api to connect Minter Blockchain here more info <a href="https://funfasy.dev/" title="https://funfasy.dev/" rel="nofollow">FunFasy</a></li> <li>YYY.cash api to generate containers with money here more info <a href="https://push.money/swagger" title="https://push.money/swagger" rel="nofollow">YYY.cash</a></li> </ul> <h3></a>What about woocomerce?</h3> <p>Currently, you can create cupon with minter push id and also add your price for BIP. That means when push creates woocommerce generate a coupon with a fixed discount with the amount in a push.</p> <h2>Changelog</h2> <h3>1.0</h3> <ul> <li>Add language: Russian.</li> <li>Add support to generate coupons.</li> <li>Add FunFasy_helper (send transaction) .</li> <li>Add YYY_push (the object that has all info about the push and working with it).</li> <li>Add Admin Interface.</li> <li>Add New Post type: minter-push. (You can view all generated pushes)</li> </ul>
es_es: <h1> Bienvenidos A Minter YYY Devolución de dinero plugin! </h1> <h2>Descripción</h2> <p>Plugin creado para <code> #MinterPush 0.2 – Recompensas Hackathon – Suscripciones</code></p> <p>CADA pregunta sobre este complemento se hace aquí <a href=«https://t.me/mntshop_official_group» rel=«nofollow»>[Official Telegram group]</a> Sería respondido.</p> <p>Wordpress Plugin te da el poder de recompensas a tu cliente! Ejemplo de registro. Usa FunFasy.dev para enviar minter transacción y YYY.cash para generar contenedores con dinero.</p> <p>Lanzar junto a la configuración de tutorial</p> <h3>En ajustes de plugin</h3> <h4>FUNFASY Sección de configuración</h4> <p>Registrarse en <a href=«https://funfasy.dev/« rel=«nofollow»>https://funfasy.dev/</a> y obtenga sus claves API e ingrese su: <code>PROJECTO ID</code> <code>PROJECTO SECRETO</code></p> <h4>Sección Configuración de Billetera Minter</h4> <blockquote> <p>Cuando instala un complemento que genera una nueva billetera vacía para enviar recompensas.</p> </blockquote> <p>Ingrese su moneda aquí. Todas las recompensas generadas se enviarán en esa moneda.</p> <p>El saldo se mostraría en la moneda.</p> <blockquote> <p>También en esta sección contiene toda la información sobre billetera. Como la frase mnemónica de billetera, simplemente copie y pegue en su aplicación de billetera, por ejemplo aquí <a href=«https://wallet.bip.to» title=«BIP Wallet» rel=«nofollow»>BIP Wallet</a>. Y puede administrar su billetera nueva billetera.</p> </blockquote> <h4 >Sección de configuración de recompensas</h4> <blockquote> <p>En esta sección tenemos todos los eventos predefinidos como <code>Registrarse en el sitio </code>. Puede personalizarlo, pero primero, activarlo y configurarlo.</p> </blockquote> <p>Opciones Disponibles:</p> <ul> <li>Activo (activar recompensa)</li> <li>Generar contraseña (si desea generar una contraseña aleatoria para la recompensa)</li> <li>¿Cuántas monedas quiere recompensar? (cuántas monedas se enviarán para esta recompensa)</li> <li>Configuración de inserción de personalización (Personalizar recompensa)</li> <li>Configuración de notificaciones por correo electrónico (Personalizar notificaciones por correo electrónico como de, plantilla y algún mensaje condicional)</li> </ul> <blockquote> <p>Siéntase libre de usar la configuración predeterminada como una plantilla</p> </blockquote> <h4>Sección de configuración de Woocommerce</h4> <blockquote> <p>En esta sección, guarde los parámetros para woocommerce.</p> </blockquote> <p>Opciones Disponibles:</p> <ul> <li>Precio BIP (en primer lugar, dígale al complemento cuántos cuestan BIP en su moneda local)</li> <li>Coupon generate ( You can activate coupon generator. After activated all rewards will generate woocommerce coupons basically on BIP cost )</li> </ul> <h2>Preguntas frecuentes</h2> <h3>¿Qué servicios utilizas?</h3> <p>Nosotros usamos:</p> <ul> <li>API de FunFasy para conectar Minter Blockchain aquí más información <a href=«https://funfasy.dev/« title=«https://funfasy.dev/« rel=«nofollow»>FunFasy</a></li> <li>YYY.cash api para generar contenedores con dinero aquí más información <a href=«https://push.money/swagger» title=«https://push.money/swagger» rel=«nofollow»>YYY.cash</a></li> </ul> <h3></a>¿Qué pasa con woocommerce?</h3> <p>Actualmente, puede crear un cupón con minter push id y también agregar su precio para BIP. Eso significa que cuando push crea woocommerce, genera un cupón con un descuento fijo con la cantidad en un push.</p> <h2>Changelog</h2> <h3>1.0</h3> <ul> <li>Añadir idioma: Ruso.</li> <li>Añadir soporte para generar cupones.</li> <li>Añadir FunFasy_ayudante (enviar transacción) .</li> <li>Añadir YYY_push (el objeto que tiene toda la información sobre el empuje y el trabajo con él.).</li> <li>Añadir Interfaz de administrador.</li> <li>Añadir Nuevo tipo de publicación: minter-push. (Puede ver todos los empujes generados)</li> </ul>
ru_ru: <h1> Добро пожаловать в Minter YYY Cashback плагин! </h1> <h2>Описание</h2> <p>Плагин, созданный для <code> #MinterPush 0.2 – Rewards Hackathon–Subscriptions</code></p> <p>На все вопросы связанные с установкой или настройкой отвечаем в <a href=«https://t.me/mntshop_official_group» rel=«nofollow»>[Official Telegram group]</a> .</p> <p>Плагин Wordpress дает вам возможность вознаграждать вашего клиента/подписчика! Например при регистрации. Используется FunFasy.dev для отправки транзакции и YYY.cash для создания контейнеров с деньгами.</p> <p>Ниже инструкция по базовым настройкам</p> <h3>Настройки плагина</h3> <h4>FUNFASY раздел настроек</h4> <p>Сначала зарегистрируйтесь <a href=«https://funfasy.dev/« rel=«nofollow»>https://funfasy.dev/</a> и получите ваши API ключи и введите их: <code>PROJECT ID</code> <code>PROJECT SECRET</code></p> <h4>Minter Wallet раздел настроек</h4> <blockquote> <p>При установке плагина, генерируется новый пустой кошелек для отправки наград.</p> </blockquote> <p>Вставьте свой тикер монеты или просто BIP. Все сгенерированные награды будут отправлены в этом тикере.</p> <p>Баланс также отразится в указанном тикере</p> <blockquote> <p>Также данная секция настроек содержит информацию о вашем кошельке. Такую как, например, мнемоническую фразу, вы можете просто скопировать и вставить её в ваш кошелек например здесь <a href=«https://wallet.bip.to» title=«BIP Wallet» rel=«nofollow»>BIP Wallet</a>. И вы сможете администрировать ваш кошелек.</p> </blockquote> <h4 >Награды раздел настроек</h4> <blockquote> <p>В данном разделе настроек хранятся все стандартные события наград например <code>Регистрация на сайте</code>. Вы можете их кастомизировать, но сначала, проведите настройку и активируйте.</p> </blockquote> <p>Доступные опции:</p> <ul> <li>Активировать награду? (Активирует награду)</li> <li>Генерировать пароли для пушей? (Генерирует пароли для каждого пуша этого типа)</li> <li>Сколько монет потратить на награду? (Сколько стоит ваша награда в выбранном тикер)</li> <li>Настройка кастомизации пушей (Кастомизируйте отправляемую награду)</li> <li>Email уведомления (Настройки Email уведомлений, таких как От кого, или шаблон)</li> </ul> <blockquote> <p>Можете использовать предустановленные значения. Протестируйте награду создав тестового пользователя на сайте.</p> </blockquote> <h4>Woocommerce раздел настроек</h4> <blockquote> <p>Здесь хранится параметры относящиеся к WooCommerce </p> </blockquote> <p>Доступные опции:</p> <ul> <li>Стоимость BIP( Для начала скажите плагину сколько стоит BIP в вашей валюте )</li> <li>Генерировать купоны? ( Вы можете активировать генератор купонов. После активации все награды будут генерировать купоны WooCommerce основываясь на стоимости BIP )</li> </ul> <h2>Часто задаваемые вопросы</h2> <h3>Какие сервисы использует плагин?</h3> <p>Мы используем:</p> <ul> <li>FunFasy API для подключения к Minter Blockchain, здесь больше информации <a href=«https://funfasy.dev/« title=«https://funfasy.dev/« rel=«nofollow»>FunFasy</a></li> <li>YYY.cash API для генерирования контейнеров с деньгами, здесь больше информации <a href=«https://push.money/swagger» title=«https://push.money/swagger» rel=«nofollow»>YYY.cash</a></li> </ul> <h3></a>Что насчет WooCommerce?</h3> <p> На данный момент, вы можете создавать купоны вместе с наградами соды создаются из push #LINK_ID#, также вы можете задать свою цену за BIP (Стандартный тикер Minter Blockchain) Это означает, что когда создается пушицы WooCommerce генерирует купон с фиксированной скидкой стоимости награды <h2>История изменений</h2> <h3>1.0</h3> <ul> <li>Добавлен язык: Русский.</li> <li>Добавлена поддержка генерирования купонов.</li> <li>Добавлен FunFasy_helper (для отправки транзакций) .</li> <li>Добавлен объект YYY_push (объект в котором находятся все методы и свойства для работы с пушами).</li> <li>Добавлена админка.</li> <li>Новый Post type: minter-push. (Можно просмотреть информацию обо всех созданных пушах)</li> </ul>

source: Save all changes
es_es: Guarda todos los cambios
ru_ru: Сохранить все изменения

source: gives bonuses for registration!
es_es: da bonificaciones por el registro!

source: We have a present for you! Check this out and spend it!
es_es: ¡Tenemos un regalo para ti! ¡Mira esto y gástalo!
ru_ru: Мы подготовили подарок, всем кто регистрируется на нашем сайте, и это не просто купон, это контейнер с настоящими деньгами! Проходи по ссылке и потрать его!

source: Coupon with true money!
es_es: Cupón de dinero real!
ru_ru: Купон с настоящими деньгами!

source: Or you can fill on checkout and get discount! <b> coupon code: #PUSH_LINK_ID# </b>
es_es: ¡O puede completar el pago y obtener un descuento! <b> coupon code: #PUSH_LINK_ID# </b>
ru_ru: Также, вы сможете погасить подарок на нашем сайте, использовав <b> КУПОН: #PUSH_LINK_ID# </b>

source: To open fill <b> password: #PUSH_PASSWORD# </b>
es_es: Para abrir complete <b> password: #PUSH_PASSWORD# </b>
ru_ru: Для открытия пуша вам понадобится <b> пароль : #PUSH_PASSWORD# </b>

source: Geman Vereschak
ru_ru: Герман Верещак

source: Beige
ru_ru: Бежевый
